#include <iostream>

int main() {
 //Написать программу, которая из имеющегося массива строк формирует массив строк, длина которых меньше или равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами. 
char a ; 
char b; 
char c; 
std::cout << 'Введите символы с клавиатуры: ' >> std::endl;
std::cin >> a; 
std::cin >> b; 
std::cin >> c; 

}